[
	{
		"num": 1,
		"title": "Welcome to Python!",
		"visible": true,
		"days": [
			{
				"title": "Welcome to Python!",
				"date": "2021-03-30",
				"description": "Hello world! Welcome to CS41. In this lecture, students will be introduced to the course and to the basic building blocks of Python. We will cover the interactive interpreter, variables and types, numbers and booleans, strings and lists, string formatting, control flow, loops, and functions."
			},
			{
				"title": "Python Basics",
				"date": "2021-04-01",
				"description": "Our rapid progression through Python fundamentals continues, as we cover comments, console I/O, and file I/O, running Python as a script, modules, imports, and virtual environments."
			}
		],
		"dates": {
			"start": "2021-03-29",
			"end": "2021-04-02"
        },
        "assignments": "Assignment 0 - Welcome to Python!",
        "assignmentLink": null
	},
    {
    	"num": 2,
    	"title": "Data Structures",
    	"visible": true,
    	"days": [
    		{
    			"title": "Data Structures",
    			"date": "2021-04-06",
    			"description": "In this lecture, we'll dive into Python's standard tools for data manipulation. Together with a review of lists from last week, we'll see dictionaries, tuples, and sets, along with all of their common operators (and even a few uncommon ones!). We briefly look at a few looping techniques (enumerate, zip), and then dive into comprehensions."
    		},
    		{
    			"title": "Data Structures Lab",
    			"date": "2021-04-08",
    			"description": "The first full-length lab of CS41 features a wide collection of small problems, selected to practice topics from the first three course lectures, and to solidify course concepts."
    		}
    	],
    	"dates": {
    		"start": "2021-04-05",
    		"end": "2021-04-09"
    	},
        "assignments": "Assignment 0 - Welcome to Python!",
        "assignmentLink": null
    },
    {
    	"num": 3,
    	"title": "Object-Oriented Python",
    	"visible": true,
    	"days": [
    		{
    			"title": "Object-Oriented Python",
    			"date": "2021-04-13",
    			"description": "Python provides builtin support for the object oriented programming paradigm. In this lecture, we will explore namespaces and scope, the Python data model, class objects, and inheritance. We will review the difference between class objects and instance objects, and we will learn about methods associated with class objects as well as Python's special 'magic methods'."
    		},
    		{
    			"title": "Object-Oriented Python Lab",
    			"date": "2021-04-15",
    			"description": "In this lab, students will deepen their understanding of object-oriented programming in Python by writing classes and methods. We start with simple classes - first writing a class to represent a Stanford class - and gradually build in complexity to implement a graph and associated graph algorithms, and a class which represents a polynomial, and which uses Python's magic methods to hook into Python's builtin mathematical operations."
    		}
    	],
    	"dates": {
    		"start": "2021-04-12",
    		"end": "2021-04-16"
    	},
        "assignments": "Assignment 1 - Cryptography",
        "assignmentLink": null
    },
    {
        "num": 4,
        "title": "Functions",
        "visible": true,
        "days": [
            {
                "title": "Functions",
                "date": "2021-04-20",
                "description": "We've seen functions in other languages, but Python gives us additional tools in defining and calling functions. After reviewing some nuances in the function execution model regarding return values, scope, and pass-by semantics, we'll see keyword arguments alongside their familiar positional counterparts. We'll discuss variadic arguments, default arguments, and their relation to str.format. Lastly, we peek into an odd quirk of Python - that functions are objects, and can be treated as such."
            },
            {
                "title": "Functions Lab",
                "date": "2021-04-22",
                "description": "In this lab, students will leverage their knowledge of positional, keyword, and variadic arguments to differentiate valid function calls from invalid ones. Then, students will write functions making use of positional, keyword, and variadic arguments to solve several problem scenarios. Students will also explore the problem of mutable default arguments - an example of a tricky edge case resulting from the way in which Python evaluates function arguments."
            }
        ],
        "dates": {
            "start": "2021-04-19",
            "end": "2021-04-23"
        },
        "assignments": "Assignment 1 - Cryptography",
        "assignmentLink": null
    },
    {
        "num": 5,
        "title": "Python and the Web",
        "visible": true,
        "days": [
            {
                "title": "Python and the Web",
                "date": "2021-04-27",
                "description": "We'll begin with one of the most exciting applications of Python: it interacts so well with the internet. We'll start with using Python to query and parse websites. After that, we'll transition to server-side web development and discuss how to build websites backed by Python. This lecture is the most demo-heavy of the quarter and by the end, we'll build an full-fledged web application, backed by Python."
            },
            {
                "title": "Python & the Web Lab",
                "date": "2021-04-29",
                "description": "This is an open-ended lab session. Students begin by exploring the API Resource sheet we've put together and interacting with APIs online. Then, they'll transition to building and deploying a Flask application. Optionally, students can implement an HTML component to their web application."
            }
        ],
        "dates": {
            "start": "2021-04-26",
            "end": "2021-04-30"
        },
        "assignments": "Assignment 2 - Quest for the Unicorn",
        "assignmentLink": null
    },
    {
        "num": 6,
        "title": "Python and the Web, Continued",
        "days": [
            {
                "title": "Python and the Web, Continued",
                "date": "2021-05-04",
                "description": "By popular request, we're continuing this lecture with a focus on the topics that people expressed interest in on the mid-quarter feedback form. We're going to do a deep dive into building a web app and really tease Flask apart as a library, to how it works. We'll use the requests library as an introduction to this topic and end the lecture by making and deploying our own Flask apps."
            },
            {
                "title": "Python and the Web Lab",
                "date": "2021-05-06",
                "description": "This lab will build on the previous lab session by beginning with the same problem as the last one ended with: students will implement (or revisit) the flask application that they built to display a list of anagrams to the user. Then, we'll augment this by moving other Python features and assignments into the Flask app format. Optionally, students will set up their own accounts on pythonanywhere.com and build a personal application."
            }
        ],
        "visible": true,
        "dates": {
            "start": "2021-05-03",
            "end": "2021-05-07"
        },
        "assignments": "Assignment 2 - Quest for the Unicorn",
        "assignmentLink": null
    },
    {
        "num": 7,
        "title": "Functional Programming",
        "visible": true,
        "days": [
            {
                "title": "Functional Programming",
                "date": "2021-05-11",
                "description": "We first discuss functional programming's place in the landscape of programming paradigms - what makes this different from Java and C++ - and then introduce the concept of higher-order functions through map and filter, and anonymous lambda functions. We'll understand iterators, generator expressions, and generators as core ideas in functional programming, and briefly talk about where these tools could show up in Python. Lastly, we'll go over decorators - an amazing application of functional programming ideas to solve common programming problems."
            },
            {
                "title": "Functional Programming Lab",
                "date": "2021-05-13",
                "description": "In this lab, students will leverage their knowledge of functions and FP to explore the new programming paradigm that we've found in Python. We'll practice with map, filter, and lambda, and then explore functools.reduce and the operator module for more depth. As a thought experiment, we briefly discuss how to convert iterative Python code to functional code, and then practice with iterators and generators, using the itertools module to build power operators from linear algebra in under ten lines of Python. Closure semantics are also reviewed as a preview for the main event - writing decorators!"
            }
        ],
        "dates": {
            "start": "2021-05-10",
            "end": "2021-05-12"
        },
        "assignments": "Assignment 2 - Quest for the Unicorn",
        "assignmentLink": null
    },
    {
        "num": 8,
        "title": "Standard Libraries",
        "visible": true,
        "days": [
            {
                "title": "Standard Libraries",
                "date": "2021-05-18",
                "description": "To many, the most important feature of a programming language is not syntax or program flow, but rather the work that prior programmers have put in to make routine computations straightforward. In this lecture, we teach students to explore Python's standard libraries. We first cover the basics of reading documentation, then we delve into the the rich depth and diversity of libraries that Python has to offer. We explore pdb, Python's debugging library, and move into specialized containers, regex tools, customizable iterators, and system-level interactions. If there's time, we explore temporal modules, like timeit and datetime, and libraries for file compression."
            },
            {
                "title": "TBD",
                "date": "2021-05-20",
                "description": "In lab groups, students will program a Raspberry Pi to navigate a maze and, next week, will compete against each other to see who can complete the maze fastest."
            }
        ],
        "dates": {
            "start": "2021-05-17",
            "end": "2021-05-21"
        },
        "assignments": "Assignment 2 - Quest for the Unicorn, Final Project",
        "assignmentLink": null
    },
    {
        "num": 9,
        "title": "Third-Party Packages",
        "visible": true,
        "days": [
            {
                "title": "Third-Party Packages",
                "date": "2021-05-25",
                "description": "Though the Python standard libraries contain a substantial number of useful tools, the Python community has also built up a series of third-party libraries for various applications. In this lecture, we introduce students to Pypi.org and the develpment of third-party Python packages, after which we provide a survey of some of of the most popular and useful third-party Python packages."
            },
            {
                "title": "TBD",
                "date": "2021-05-27",
                "description": "This is the Raspberry Pi Car Competition! Today, students will compete against other teams to finish the maze fastest. The winning team gets a special prize, on us. 🙃"
            }
        ],
        "dates": {
            "start": "2021-05-24",
            "end": "2021-05-28"
        },
        "assignments": "Final Project",
        "assignmentLink": null
    },
    {
        "num": 10,
        "title": "Final Project",
        "visible": true,
        "days": [
            {
                "title": "Final Project Work Period",
                "date": "2021-06-01",
                "description": "It's dead week - you deserve a break. Lecture this week will be replaced by a final project work period in which TAs will be circulating to answer any questions."
            },
            {
                "title": "Final Project Presentations",
                "date": "2021-06-03",
                "description": "Students will have the opportunity to give a quick presentation to demo their final projects for the class."
            }
        ],
        "dates": {
            "start": "2021-05-31",
            "end": "2020-06-04"
        },
        "assignments": "None - Good Luck with Finals!",
        "assignmentLink": null
    }
]