[
	{
		"uid": "dc942bfc-9d7c-40f2-89f7-b28ab32ecb2b",
		"title": "Assignment 2 Released",
		"content": "Assignment 2 is out! Gather your fellow knights and get ready to find the holy grail!",
		"date": "2016-04-29",
		"visible": true
	},
	{
		"uid": "ccb1ee56-b0c5-4c43-9e6a-15293cc4aee6",
		"title": "A New Look and Feel",
		"content": "Check out our snazzy new website! This class is starting to look good :) There are lots of new features too, including this handy announcements feed. You can click through the tabs at the top of the page to navigate. If there are any feature requests you'd like to see added to the website, or perhaps bugs to report (especially on different screen sizes or browsers), please email me directly at sredmond@stanford.edu. I've retroactively added old announcements that were previously distributed via Piazza or email.",
		"date": "2016-04-27",
		"visible": true
	},
	{
		"uid": "109956c4-48b3-49ef-b77d-b701e4865d8c",
		"title": "Assignment 1 Feedback Released",
		"content": "We've just made feedback on Assignment 1 available to everyone. You should have received an email with a link to your feedback page. If not, please let us know so we can give you your feedback and grades. As a reminder, you can schedule optional 1-on-1s (like IGs) to review your assignment if you are unhappy with it. The mode grade was a check-plus for functionality and a check for style.",
		"date": "2016-04-26",
		"visible": true
	},
	{
		"uid": "1e95171f-7b02-4c37-bbe7-f08753b24f4d",
		"title": "Enrollment Update and Auditing Policies",
		"content": "If you haven't yet received an enrollment code but have been accepted into CS41, use the admissions page linked from the course info tab to generate your personal code. If you would like to audit the course but not enroll for credit, great! Auditors are welcome to attend lecture, access our materials, ask questions on Piazza, and complete labs and assignments on their own, but work is not handed in or graded.",
		"date": "2016-04-13",
		"visible": true
	},
	{
		"uuid": "4f032476-2860-4cb1-84ed-52835ab40bf1",
		"title": "Assignment 1 Released",
		"content": "The first assignment is a cryptography suite, covering the commonly-known Caesar and Vigenere ciphers along with the more challenging Merkle-Hellman Knapsack Cryptosystem.",
		"date": "2016-04-06",
		"visible": true
	},
	{
		"uuid": "3cd6aa62-e023-40e7-a2d8-c5988dfd6ea0",
		"title": "Welcome to Python!",
		"content": "Hello world! Welcome to 'CS 41: hap.py code', covering the fundamentals and contemporary usage of the Python programming language. This quarter is going to be amazing and I hope that you'll come along for the ride.",
		"date": "2016-03-27",
		"visible": true
	}
]