[
	{
		"uid": "76df5291-8a67-4aa0-a212-109f39506b51",
		"title": "Final Project Proposal Released",
		"content": "Take a look at the final project specification and use https://goo.gl/forms/dYe4tkL6TWxslmkY2 to submit a proposal. Feel free to get started on the project itself as well!",
		"date": "2019-02-19",
		"visible": true
	},
	{
		"uid": "76df5291-8a67-4180-a212-109f39506b51",
		"title": "Assignment 1 Released",
		"content": "Assignment 1 is now released! Thank you for your patience. It is available under the Assignments tab.",
		"date": "2019-02-12",
		"visible": true
	},
	{
		"uid": "81980680-44c2-4185-9e6e-76358d7b8df3",
		"title": "Assignment 0 Released",
		"content": "Assignment 0 is now released! It is available under the Assignments tab.",
		"date": "2019-01-12",
		"visible": true
	},
	{
		"uid": "fa079ad8-a134-47d3-9ba4-76183754c76d",
		"title": "Python Installation Instructions Released!",
		"content": "We've released guided installation instructions for Python 3.7.2 and virtual environments for macOS and Linux, with Windows instructions coming soon. You can find these handouts under the Resources tab.",
		"date": "2019-01-11",
		"visible": true
	},
	{
		"uid": "8f7c2dea-66ef-403f-af3e-a481f602525b",
		"title": "Enrollment Codes and Axess",
		"content": "We want to clarify a potentially confusing detail about enrollment. In order to be eligible to enroll in this course, you must submit an application to http://apply.stanfordpython.com/. Having done so, you should have received an email from me with your acceptance status. Once we receive the collection of enrollment codes from the department, we will be distributing them to accepted students. If you need to officially enroll on a more accelerated timeline, please let a member of the course staff know.",
		"date": "2019-01-10",
		"visible": true
	},
	{
		"uid": "60406c7f-c6e3-4d39-8bc1-8aa71c0c7459",
		"title": "Tracking Attendance!",
		"content": "This quarter, we're tracking attendance using the Google form at http://iamhere.stanfordpython.com/. During class, we will write an attendance code for the day on the board, which you should submit so that we know you attended lecture.",
		"date": "2019-01-10",
		"visible": true
	},
	{
		"uid": "80cfe1c9-284a-42dc-b102-2f6a9c06dfcc",
		"title": "First Day of CS41!",
		"content": "We're very excited to see you all this Tuesday for the first day of class in 380-380D!",
		"date": "2019-01-07",
		"visible": true
	},
	{
		"uid": "a760b855-42b3-497d-8228-2beea1e8daa1",
		"title": "Course Applications",
		"content": "We are now accepting applications for CS41! You can apply at http://apply.stanfordpython.com/",
		"date": "2018-12-12",
		"visible": true
	},
	{
		"uid": "9a4cb45e-c3d4-42c4-8ede-6dfd7c21e0e5",
		"title": "Welcome to Python!",
		"content": "Hello world! Welcome to \"CS 41: hap.py code.\" This course covers the fundamentals and contemporary usage of the Python programming language. This quarter is going to be amazing and I hope that you'll come along for the ride!",
		"date": "2018-12-01",
		"visible": true
	}
]