[
	{
		"uid": "da11da40-623d-4aa4-b877-833feb50b17e",
		"num": 1,
		"title": "Welcome to Python!",
		"visible": true,
		"days": [
			{
				"title": "Welcome to Python",
				"date": "2020-01-06",
				"active": false,
				"description": "Hello world! Welcome to CS41. Topics covered: why take CS41, history and context of Python, zen and philosophy of Python, who uses Python, and lots of Python fundamentals (using the interpreter, comments, variables, types, numbers, math, booleans, logic, strings, lists, slicing, console I/O, control flow, loops, range, functions)"
			},
			{
				"title": "Python Fundamentals",
				"date": "2020-01-08",
				"active": false,
				"description": "Our rapid progression through Python fundamentals continues, covering: objects, variables, and types, duck typing, equality vs. identity testing, additional useful string methods, string formatting (using .format()), file I/O (using a context manager), running Python as a script, the basics of imports, and virutal environments."
			}
		],
		"dates": {
			"start": "2020-01-06",
			"end": "2020-01-10"
		}
	},
    {
    	"uid": "6daa4c3e-6c85-44e0-be87-15707909aee9",
    	"num": 2,
    	"title": "Data Structures",
    	"visible": true,
    	"days": [
    		{
    			"title": "Data Structures",
    			"date": "2020-01-13",
    			"active": false,
    			"description": "Python's numerous tools for standard data manipulation makes life easy for programmers. Together with a review of lists from last week, we'll see dictionaries, tuples, and sets, along with all of their common operators and even a few uncommon ones. We briefly look at a few looping techniques (enumerate, zip), and then dive into comprehensions. Python allows us to write list, dictionary, and set comprehensions, and we'll explore these tools as well as their connection to higher-level reasoning about problem-solving."
    		},
    		{
    			"title": "Data Structures Lab",
    			"date": "2020-01-15",
    			"active": false,
    			"description": "The first full-length lab of CS41 features a wide collection of small problems, chosen to practice the many, many topics covered in the first three days of lecture and solidify concepts that may not have been absorbed on the first pass."
    		}
    	],
    	"dates": {
    		"start": "2020-01-13",
    		"end": "2020-01-17"
    	}
    },
    {
        "uid": "db3a82fa-ec5f-4732-b6f5-8a0f776f06ff",
        "num": 3,
        "title": "Functions",
        "visible": true,
        "days": [
            {
                "title": "MLK Day",
                "date": "2020-01-20",
                "active": false,
                "description": "HOLIDAY"
            },
            {
                "title": "Functions",
                "date": "2020-01-22",
                "active": false,
                "description": "We've seen functions in other languages, but Python gives us additional tools in defining and calling functions. After reviewing some nuances in the function execution model regarding return values, scope, and pass-by semantics, we'll see keyword arguments alongside their familiar positional counterparts. We'll discuss positional arguments, keyword arguments, default arguments, and their relation to str.format. Lastly, we peek into an odd quirk of Python - that functions are objects, and can be treated as such."
            }
        ],
        "dates": {
            "start": "2020-01-20",
            "end": "2020-01-24"
        }
    },
    {
        "uid": "4f5f2a6a-dcda-4689-a534-b3052ef37952",
        "num": 4,
        "title": "Functional Programming",
        "visible": true,
        "days": [
            {
                "title": "Functional Programming",
                "date": "2020-01-27",
                "active": false,
                "description": "We first discuss functional programming's place in the landscape of programming paradigms - what makes this different from Java and C++ - and then introduce the concept of higher-order functions through map and filter, and anonymous lambda functions. We'll understand iterators, generator expressions, and generators as core ideas in functional programming, and briefly talk about where these tools could show up in Python. Lastly, we'll go over decorators - an amazing application of functional programming ideas to solve common programming problems."
            },
            {
                "title": "Functions and FP Lab",
                "date": "2020-01-29",
                "active": false,
                "description": "This lab first drills function argument rules, then asks you to write functions utilizing the new superpowers offered by Python functions. Several function nuances are covered, including the danger of mutable default values. Then, we conduct a more thorough investigation of function objects and their attributes, at least in CPython. After, we'll use functions to explore the new programming paradigm that we've found in Python. We'll practice with map, filter, and lambda, and then explore functools.reduce and the operator module for more depth. As a thought experiment, we briefly discuss how to convert iterative Python code to functional code, and then practice with iterators and generators, using the itertools module to build power operators from linear algebra in under ten lines of Python. Closure semantics are also reviewed as a preview for the main event - writing decorators!"
            }
        ],
        "dates": {
            "start": "2020-01-27",
            "end": "2020-01-31"
        }
    },
    {
        "uid": "5caba9d5-91cc-4594-9a3e-ed2f86543847",
        "num": 5,
        "title": "Python and the Web",
        "visible": true,
        "days": [
            {
                "title": "Python and the Web",
                "date": "2020-02-03",
                "active": false,
                "description": "We'll begin with an introduction to object-oriented programming in Python and a discussion of classes. Then, we'll turn to one of the most exciting applications of Python: it interacts so well with the internet. We'll start with using Python to query and parse websites. We'll talk about the design of websites and web languages like HTML and JSON. Then we'll discuss how to use Python to interact with these technologies by querying websites and parsing the response. We'll take a relevant detour to discuss Python's image processing libraries and how to process images on the web. After that, we'll transition to server-side web development and discuss how to build websites backed by Python. This lecture is the most demo-heavy of the quarter and by the end, we'll build an anagrammer application, backed by Python."
            },
            {
                "title": "Web Requests Lab",
                "date": "2020-02-05",
                "active": false,
                "description": "This lab is very free-form. You can choose to implement a Reddit Wallpaper Scraper, which was a former assignment in CS 41, or you can work on pretty much anything else! It's getting to be midterm season, and we want everyone to enjoy themselves, and have fun learning Python in a low-stress environment. You could choose to explore more Python functions and features, start a final project, or continue in our Quest for the Unicorn."
            }
        ],
        "dates": {
            "start": "2020-02-03",
            "end": "2020-02-07"
        }
    },
    {
        "uid": "bbf3fa0a-0a79-4ed4-b7dd-1172e5083bd8",
        "num": 6,
        "title": "NumPy",
        "visible": true,
        "days": [
            {
                "title": "NumPy",
                "date": "2020-02-10",
                "active": false,
                "description": "Transitioning into the \"data science\" focus of CS 41, this lecture focuses on numerical computing in Python. We start by discussing the ndarray, the canonical Numpy object, and explore its properties (axes, shape). We then proceed onwards to ndarray functions and transformations, and the nuances of functions acting on multi-dimensional objects (like broadcasting). We then apply what we've learned to statistical computing methods in Python, and to the standard linear parameter fitting problem."
            },
            {
                "title": "NumPy Lab",
                "date": "2020-02-12",
                "active": true,
                "description": "The first segment of this lecture is composed of some tricky ndarray manipulation problems. Next, we move on to a fun movie prediction model to predict which movies their classmates will most enjoy. Then, for a whimsical twist, we introduce the Pandas data processing library, and students employ properties of Pandas arrays to create beautiful ascii art. And finally, in Part 2 of the lab, we explore Object-Oriented Python, bringing a close to our exploration of Python's core language features."
            }
        ],
        "dates": {
            "start": "2020-02-10",
            "end": "2020-02-14"
        }
    },
    {
        "uid": "643dace4-4db6-43c1-ac2d-7953e5679af6",
        "num": 7,
        "title": "Third Party & Standard Libraries",
        "visible": true,
        "days": [
            {
                "title": "President's Day",
                "date": "2020-02-17",
                "active": false,
                "description": "PRESIDENT'S DAY"
            },
            {
                "title": "Third Party & Standard Libraries Lab",
                "date": "2020-02-19",
                "active": false,
                "description": "To many, the most important feature of a programming language is not syntax or program flow, but rather the work that prior programmers have put in to make routine computations straightforward. In this lecture, we explore the Python standard libraries, and delve into the rich depth and diversity of libraries that Python has to offer. We start by exploring pdb, Python's debugging library, and quickly move into specialized containers, regex tools, customizable iterators, and system-level interactions. If there's time, we explore temporal modules, like timeit and datetime, and libraries for file compression."
            }
        ],
        "dates": {
            "start": "2020-02-17",
            "end": "2020-02-21"
        }
    }
]