[
    {
        "uid": "8d1ea661-59af-4c48-8f3b-c1c9a892481d",
        "title": "Mid-Quarter Evaluation",
        "content": "If you're a CS 41 student, go to this link to fill out a mid-quarter evaluation: https://forms.gle/BNr58ergCR3bwp1U6. Responses are anonymous, and the feedback is invaluable; in part, it determines if this course will be offered in the future.",
        "date": "2020-02-05",
        "visible": true
    },
    {
        "uid": "1cf471c0-78e0-4270-beb7-31004bc2482a",
        "title": "Assignment 2",
        "content": "Assignment 2 has been released! Unicornelius is counting on you to find them! Here's the link: https://github.com/stanfordpython/python-assignments/blob/master/assign2/README.md",
        "date": "2020-02-03",
        "visible": true
    },
    {
        "uid": "c044b1f7-1a66-48f6-9ad8-7a33961cc4e3",
        "title": "Permission Numbers",
        "content": "We've released permisssion numbers for people who have been admitted to CS 41. Find your permission number by visiting https://stanfordpython.com/admissions.html and entering your SUNet ID.",
        "date": "2020-01-12",
        "visible": true
    },
    {
        "uid": "bc440451-0d53-42dd-a55f-a797be6d7d6f",
        "title": "Lab Preferences Form",
        "content": "We're in the process of assigning students to TAs for lab groups. We're doing this based on your application to the class and your introduction email.\n\nIf there's something else we should keep in mind or if you have a group of people you'd like to work with during lab time, let us know by filling out this form: https://forms.gle/92y5zB9uVxdLoanm8. You only need to fill the form out if there's something we should keep in mind that you haven't yet expressed to us. You'll be informed of your assignments before class time next Wednesday!",
        "date": "2020-01-09",
        "visible": true
    },
    {
        "uid": "136ea15a-ed8d-47c3-a437-958d54d8dbe4",
        "title": "Welcome to Stanford Python!",
        "content": "Hello world! Welcome to \"CS 41: hap.py code.\" This course covers the fundamentals and contemporary usage of the Python programming language. This quarter is going to be amazing and I hope that you'll come along for the ride!",
        "date": "2020-01-03",
        "visible": true
    }
]
